[
  {
    "title": "Tragedy and Triumph",
    "pastor": "Pastor Brad",
    "summary": "Pastor Brad teaches on enduring hardships through faith, showing how tragedy can lead to triumph in Christ.",
    "key_quotes": [
      "God can turn your tragedy into triumph.",
      "The cross looked like defeat, but it was the greatest victory."
    ],
    "themes": [
      "Endurance",
      "Faith in hardship",
      "God’s victory over trials"
    ]
  },
  {
    "title": "Get Off Your Donkey",
    "pastor": "Pastor Brad",
    "summary": "This sermon urges believers to move from apathy into action, to serve others like the Good Samaritan, and to answer the call of compassion.",
    "key_quotes": [
      "Compassion has to move from your heart to your hands.",
      "Get off your donkey and serve someone today."
    ],
    "themes": [
      "Compassion",
      "Service",
      "Actionable faith"
    ]
  },
  {
    "title": "Christian Life Austin – Sermon",
    "pastor": "Pastor Rex Johnson",
    "summary": "Pastor Rex highlights the vibrancy of Christian life, emphasizing joy, fellowship, and vitality in walking with Christ.",
    "key_quotes": [
      "Christian life is not boring—it’s full of purpose and power.",
      "God has called us into a life overflowing with joy."
    ],
    "themes": [
      "Joy",
      "Community",
      "Purpose in Christ"
    ]
  },
  {
    "title": "Be Careful in Old Age",
    "pastor": "Billy Graham",
    "summary": "Billy Graham warns believers about spiritual complacency in old age and emphasizes finishing strong in faith.",
    "key_quotes": [
      "Don’t waste your final years—make them count for Christ.",
      "It’s not how you start, but how you finish."
    ],
    "themes": [
      "Perseverance",
      "Finishing well",
      "Guarding against complacency"
    ]
  },
  {
    "title": "Entry and End Times – Identity and the Christ",
    "pastor": "Phillip Anthony Mitchell",
    "summary": "This sermon emphasizes the urgency of time running out, calling both believers and unbelievers to recognize Jesus as not only the Son of David but the Lord of David—the Messiah who is both human and divine. Pastor Mitchell presses the point that identity in Christ is under attack, both for believers and even historically against Christ Himself. The sermon rebukes inadequate or false views of Jesus and calls for reverence, surrender, and living under His Lordship.",
    "key_quotes": [
      "You can belong before you believe, but time is running out.",
      "This is not the hour to be distracted by foolishness—this is the hour to be locked in with your relationship with the Lord.",
      "What do you think about the Christ, and whose son is he?",
      "Grace will run out with those who keep rejecting the gospel.",
      "You will never be fully satisfied with anything outside of Christ.",
      "The Messiah is both the Son of David and the Lord of David—both human and divine."
    ],
    "themes": [
      "Urgency of surrender before time runs out",
      "Identity in Christ",
      "False vs. true Christ",
      "Reverence and fear of the Lord",
      "Scripture as trustworthy and Spirit-inspired",
      "Christ as both human and divine",
      "Repentance and readiness for Christ’s return"
    ]
  },
  {
    "title": "Entry and End Times – Woe to You",
    "pastor": "Phillip Anthony Mitchell",
    "summary": "This sermon from Matthew 23 highlights Jesus’ last public sermon, where He pronounces eight woes on the Pharisees and religious leaders. Pastor Mitchell shows that spiritual deception and false teachers are even more dangerous than trials, as they shut the doors of the Kingdom and lead people astray. He warns believers against spiritual hypocrisy, legalism, external righteousness without inner holiness, and false prophets—emphasizing that Jesus demanded reverence, truth, and faithfulness. The message is ultimately a sober call to guard against false teaching and to live with spiritual discernment in the last days.",
    "key_quotes": [
      "There is no Christianity without warfare.",
      "Spiritual deception is more damaging than spiritual warfare.",
      "Woe to you… hypocrites! You shut the kingdom of heaven in people’s faces.",
      "You strain out a gnat and swallow a camel.",
      "Be more impressed with character than oratory.",
      "Every time you hear truth and reject it you are just filling up wrath for the day of judgment.",
      "This is the season to be right with Christ — to open the doors of the Kingdom, not close them."
    ],
    "themes": [
      "Urgency in the last days",
      "Spiritual deception vs. discernment",
      "Jesus’ final sermon and the eight woes",
      "Hypocrisy and external righteousness",
      "Legalism vs. true justice and mercy",
      "Guarding against false prophets and heresy",
      "The weight of rejecting truth",
      "Living as door-openers, not door-shutters"
    ]
  },
  {
    "title": "Entry and End Times – Don’t Follow Them",
    "pastor": "Phillip Anthony Mitchell",
    "summary": "This sermon is a warning against following false leaders and deceptive teachers in the last days. Pastor Mitchell emphasizes that people often exalt spiritual impostors who look authoritative but lack God’s heart. He reminds the church that many will be led astray by appearances, influence, and platforms rather than by the truth of God’s Word. Believers are called to discernment, to reject circles and leaders that are not from God, and to anchor their faith in Christ alone.",
    "key_quotes": [
      "Not every group that emerges in the name of religion comes from God.",
      "Some circles look spiritual but are formed without God’s authority.",
      "Too many follow leaders because of charisma or confidence rather than Christ.",
      "In the last days, discernment is vital—we must know the difference between the heart of the Pharisees and the heart of Christ.",
      "Anchor your life in the authority of Christ, not in the applause of men."
    ],
    "themes": [
      "False leaders and deception",
      "Spiritual discernment",
      "Last days vigilance",
      "Circles and appearances vs. God’s authority",
      "Faith anchored in Christ alone"
    ]
  },
  {
    "title": "Facing Our Fears",
    "pastor": "Pastor Rex Johnson",
    "summary": "Pastor Rex preaches a message of courage and faith in God when facing trials and fears. Drawing from Scripture, he urges believers to lean into God’s presence, promises, and protection in the toughest seasons of life. He reminds the audience that fear is a natural emotion but that faith overcomes it when we anchor ourselves in God’s Word, prayer, and worship. This sermon is both deeply pastoral and empowering, challenging the church to confront their fears with confidence in Christ.",
    "key_quotes": [
      "Fear may be natural, but faith is supernatural.",
      "God has not given us a spirit of fear, but of power, love, and a sound mind.",
      "When God is with you, you can walk through the valley without terror.",
      "Worship is a weapon against fear.",
      "Courage doesn’t mean the absence of fear—it means trusting God in the middle of it."
    ],
    "themes": [
      "Faith over fear",
      "Trusting God’s presence",
      "Worship as spiritual warfare",
      "Encouragement in trials",
      "Overcoming anxiety through Christ"
    ]
  }
]